Repository: autohotkey-docs-translation/v1-ru
Catalog: omegat/project_save.tmx
Source language: en
Languages: ru

source: "AutoHotkey Help",,,"docs\index.htm","docs\index.htm",,,,,0x73500,,0x10200e,[200,0,1080,700],,,,,3,,0
ru: "Помощь AutoHotkey",,,"docs\index.htm","docs\index.htm",,,,,0x73500,,0x10200e,[200,0,1080,700],,,,,3,,0

source: "en":true,
ru: "en":"ru",

source: "https://github.com/Lexikos/AutoHotkey_L-Docs/edit/v1/docs/":true,
ru: "https://github.com/Lexikos/AutoHotkey_L-Docs/edit/v1/docs/":"https://github.com/autohotkey-docs-translation/v1-ru/edit/master/target/docs/",

source: "lib/_CommentFlag.htm":"the default comment flag (semicolon)",
ru: "lib/_CommentFlag.htm":"стандартный флаг комментария (точка с запятой)",

source: "lib/_EscapeChar.htm":"the default escape character (accent)",
ru: "lib/_EscapeChar.htm":"стандартный экранирующий символ (ударение)",

source: #AllowSameLineComments - Syntax & Usage | AutoHotkey
ru: #AllowSameLineComments - Синтаксис и использование | AutoHotkey

source: 0x409 English (United States)
ru: 0x419 Russian

source: 1.1.36.02 - December 7, 2022
ru: 1.1.36.02 - 7 Декабря 2022

source: ; This comment is a same-line comment.
ru: ; Это коментарий в той же строке.

source: SciTE4AutoHotkey is a free, SciTE-based AutoHotkey script editor.
ru: SciTE4AutoHotkey это бесплатный, основанный на SciTE редактор скриптов AutoHotkey.

source: XDebugClient is a simple open-source front-end DBGp client based on the .NET Framework 2.0.
ru: XDebugClient это простой DBGp клиент с внешним интерфейсом и открытым исходным кодом основанный на .NET Framework 2.0.

source: Download: Binary; Source Code (also see SharpDevelop, Dockpanel Suite and Advanced TreeView.)
ru: Загрузить: Бинарный файл; Исходный код (также смотри SharpDevelop, Dockpanel Suite и Advanced TreeView.)

source: Download: See DBGp plugin for Notepad++.
ru: Загрузить: Смотри расширение DBGp для Notepad++.

source: Note: File Mapping must be configured.
ru: Заметка: сопоставление файлов должно быть настроенно.

source: Note: If you press the following button, ActiveX is used to create a config file named 'chm_config.js' in the same directory as the CHM file, with the following content:
ru: Заметка: если вы нажмете следующую кнопку, ActiveX создаст конфигурационный файл с названием 'chm_config.js' в той же директории что и CHM файл со следующим содержанием:

source: This directive was removed. AutoIt scripts are no longer supported.
ru: Данная инструкция удалена. Скрипты AutoIt больше не поддерживаются.

source: A DBGp client is available as a plugin for Notepad++ 32-bit.
ru: DBGp клиент доступен как расширение для Notepad++ 32-bit.

source: Added AutoHotkey syntax highlighting.
ru: Добавлены подсветка синтаксиса AutoHotkey.

source: Additional debugging features are supported via DBGp, a common debugger protocol for languages and debugger UI communication.
ru: Дополнительные функции отладки поддерживаются через DBGp, распространенный протокол отладки для сообщения между языком и графическим средством отладки

source: Allow the debugger engine to report a language other than "php".
ru: Добавлена возможность отладчика создавать отчеты не только для PHP.

source: Allows a comment to appear on the same line as a command.
ru: Разрешает помещать комментарии на на строку на которой находится команда.

source: AutoHotkey Help
ru: Помощь AutoHotkey

source: Automatically listen for a connection from the debugger engine, rather than waiting for the user to click Start Listening.
ru: Автоматическое подключение к отлдачику, вместо ожидания нажатия кнопки Подключиться от пользователя.

source: Breakpoints.
ru: Точки остановки

source: Changes & New Features
ru: Изменния и новые особенности

source: Changes & New Features | AutoHotkey
ru: Изменения и новые особенности | AutoHotkey

source: Changes and new features introduced by the current branch of AutoHotkey development (a.k.a. AutoHotkey_L) are listed below.
ru: Изменения и новые особенности ввденеы текуущей веткой разработки AutoHotkey (a.k.a AutoHotkey_L) перечислеенны ниже

source: Changes and new features introduced by the current branch of AutoHotkey development (a.k.a. AutoHotkey_L).
ru: Изменения и новые особенности ввденеы текуущей веткой разработки AutoHotkey (a.k.a AutoHotkey_L)

source: Changes:
ru: Изменения:

source: Choose Run from the Debug menu, or press F5.
ru: Выберите Запускк из меню отладки или нажмите F5.

source: Click the left margin to set at least one breakpoint.
ru: Нажмите на левое поле, чтобы назначить точку прерывания.

source: Collapsed
ru: Свернуть

source: Color theme:
ru: Тема:

source: Configure the DBGp plugin via Plugins, DBGp, Config...
ru: Настройте расширение DBGp через Расширения, DBGp, Конфигурация...

source: Content (default)
ru: Содержимое (стандартно)

source: Content font size:
ru: Размер шрифта:

source: Dark
ru: Темная

source: Debugging Clients
ru: Средства отладки

source: Debugging Clients | AutoHotkey
ru: Средства отладки | AutoHotkey

source: Debugging features include:
ru: Функции отладки включают:

source: Examples
ru: Примеры

source: Features:
ru: Функции:

source: Fixed a performance issue with command args exceeding 4*1024*1024 chars.
ru: Исправлена проблема производительности при использовании аргументов длиннее 4*1024*1024 символов

source: For older changes, see Archived Changes.
ru: Смотри предыдущие измениня в Архиве

source: Help Settings
ru: Настройки

source: Hidden
ru: Скрыто

source: Hover over variable to show contents.
ru: Просмотр значения переменной с помощью наведения

source: If not used at the top of the script, same-line comments are not supported above the point where the directive occurs.
ru: Если расположена не в начале файла, инструкция будет работать только после строки в которой она объявлена.

source: Improved ComObjConnect to allow detecting disconnect via __Delete.
ru: Улучшенно ComObjConnect, теперь можно обнаружить отключение через __Delete.

source: In addition to DBGp support, it provides syntax highlighting, calltips/parameter info and auto-complete for AutoHotkey, and other useful editing features and scripting tools.
ru: В дополнение к поддержке DBGp он имеет подсветку синтаксиса, показывает подсказки и информацию о параметрах, автозавершение в скриптах AutoHotkey, а также множество друих полезных инструментов для создания и изменения скриптов.

source: Index
ru: Указатель

source: Inspect or edit variable contents.
ru: Проверять и изменять содержимое переменных

source: Inspect variables - select a variable name, right-click, Inspect.
ru: Просмотр переменных - выбрать имя переменной, правая кнопка мыши, просмотр.

source: Issues:
ru: Проблемы.

source: It is designed for PHP, but also works with AutoHotkey.
ru: Он разработан для PHP, но также работает с AutoHokey.

source: Large
ru: Большой

source: Launch AutoHotkey /Debug.
ru: Запустить AutoHotkey /Отладка.

source: Launch Notepad++.
ru: Запустить Notepad++.

source: Launch XDebugClient.
ru: Запустить XDebugClient.

source: Light (default)
ru: Светная (стандартная)

source: Like other directives, #AllowSameLineComments cannot be executed conditionally.
ru: Как и другие инструкции, #AllowSameLineComments не может быть активированна при условии.

source: List name and contents of variables in local/global scope.
ru: Перечисление имен и значений локальных/глобальных переменных

source: Medium (default)
ru: Средний (стандартный)

source: No mechanisms are provided to list variables or set their values.
ru: Нет механизма для составления списка переменных или задания значений.

source: Notepad++ DBGp Plugin
ru: Расширение Notepad++ DBGp

source: Only for AutoIt v2 (.aut) scripts:
ru: Только для скриптов AutoIt v2(.aut)

source: Others
ru: Другие

source: Permission denied.
ru: Доступ запрещен

source: Quick reference visibility:
ru: Видимость краткого справочника:

source: Run the CHM file as administrator or create the config file manually.
ru: Запустить CHM файл как администратор или создать конфигурационный файл вручную.

source: Run, Step Over/Into/Out.
ru: Запустить, Шаг Через/В/Из.

source: Save settings
ru: Сохранить настройки

source: Search
ru: Поиск

source: Searching...
ru: Поиск...

source: See Interactive Debugging for more details.
ru: Подробнее в разделе Интерактивная отладка

source: Selected tab:
ru: Выбранная вкладка:

source: Sidebar visibility:
ru: Видимость боковой панели:

source: Small
ru: Маленький

source: Some UIs or "clients" known to be compatible with AutoHotkey are listed on this page:
ru: На этой странице перечисленны несколько средств отладки, которые совместимы с AutoHotkey

source: Specify the settings the help should be started with by default.
ru: Настройте параметры с которыми документация должная открываться.

source: Specifying this directive at the top of any AutoIt v2 (.aut) script will enable the use of same-line comments, which are normally disabled for compatibility reasons.
ru: Объявление этой инструкции в начале любого скрипта AutoIt v2 (.aut) активирует возможность писать коментарии в той же строке, что обычно отключено из-за проблем совместимости.

source: Syntax highlighted, read-only view of the source code.
ru: Подсветка синтаксиса, режим только чтение для исходного кода.

source: The #AllowSameLineComments directive allows a comment to appear on the same line as a command (only for AutoIt v2 scripts).
ru: Инструкция #AllowSameLineComments разрешает помещать коментарии на строку на которой находится команда (только для скриптов AutoIt v2)

source: The vscode-autohotkey-debug extension enables Visual Studio Code to act as a debugger client for AutoHotkey.
ru: Расширение vscode-autohotkey-debug позволяет использовать Visual Studio Code в качесте отладчика для AutoHotkey.

source: The extension has support for all basic debugging features as well as some more advanced features, such as breakpoint directives (as comments) and conditional breakpoints.
ru: Расширение поддерживает все базовые функции отладки также как и несколько расширенных функций, таких как инструкции прерывания (как комментарии) и прерывания по условию.

source: The plugin has not been updated since 2012, and is not available for Notepad++ 64-bit.
ru: Расширение не обновлялось с 2012, и недоступно для Notepad++ 64-bit.

source: The user interface does not respond to user input while the script is running.
ru: Интерфейс не реагирует на действия пользователя во время выполнения скрипта.

source: These settings are permanent; this is, they apply for all current and future visits to this help.
ru: Эти настройки постоянные, они будут применятся при каждом открытии документации.

source: This page lists some debugging clients or UIs known to be compatible with AutoHotkey.
ru: На этой странице перечисленны несколько клиентов отладки которые совместимы с AutoHotkey

source: Truncate property values at the first null-character, since AutoHotkey currently returns the entire variable contents and XDebugClient has no suitable interface for displaying binary content.
ru: Обрезание значений свойств с первого нулевого символа, поскольку сейчас AutoHotkey возвращает полностью содержимое переменной и XDebugClient не имеет подходящего интерфейса для отображения бинарных значений.

source: Uncollapsed (default)
ru: Развернутый (стандартно)

source: Usage:
ru: Использование:

source: Very large
ru: Огромный

source: Very small
ru: Очень маленький

source: View structure of objects.
ru: Просматривать структуру объектов

source: View the call stack.
ru: Просмотр стэка вызовов

source: Visible (default)
ru: Видно (стандартно)

source: When execution hits a breakpoint, use the Debug menu or shortcut keys to step through or resume the script.
ru: Когда выполнение дойдет до точки прерывания, использйте меню отладки или горячие клавиши чтобы перешагнуть или продолжить скрипт.

source: XDebugClient should automatically open the script file.
ru: XDebugClient должен автоматически открыть файл.

source: XDebugClient was originally designed for PHP with Xdebug, but a custom build compatible with AutoHotkey is available below.
ru: XDebugClient изначально был разработан Xdebug для PHP, но существует сборка для AutoHotkey доступная по ссылкам ниже.

source: en
ru: ru
